tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "neovim/neovim"
tap "puma/puma"
tap "thoughtbot/formulae"
# Library for command-line editing
brew "readline"
# Official Amazon AWS command-line interface
brew "awscli"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Light UNIX download accelerator
brew "axel"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# TAP-compliant test framework for Bash scripts
brew "bats"
# Enables you to reproduce the CircleCI environment locally
brew "circleci"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Reimplementation of ctags(1)
brew "ctags"
# Command-line tool to interact with exercism.io
brew "exercism"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Interpreted, interactive, object-oriented programming language
brew "python"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# Automatic updates of GeoIP2 and GeoIP Legacy databases
brew "geoipupdate"
# Distributed revision control system
brew "git"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# The Kubernetes package manager
brew "helm@2", link: true
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Add GitHub support to git on the command-line
brew "hub"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# International Ispell
brew "ispell"
# Istio configuration command-line utility
brew "istioctl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Interactive environments for writing and running code
brew "jupyterlab"
# Build tool for Clojure
brew "leiningen"
# XML security library
brew "libxmlsec1"
# Run a Kubernetes cluster locally
brew "minikube"
# Open source relational database management system
brew "mysql"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Manage multiple NodeJS versions
brew "nodenv"
# Shell command parallelization utility
brew "parallel"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql", restart_service: true
# Messaging broker
brew "rabbitmq", restart_service: true
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# User interface to the TELNET protocol
brew "telnet"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Code-search similar to ack
brew "the_silver_searcher"
# Framework for scalable cross-language services development
brew "thrift"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Google's JavaScript engine
brew "v8"
# Google's open source JavaScript engine
brew "v8@3.15"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Watch files and take action when they change
brew "watchman"
# Enhances tmux's to provide multiuser terminal multiplexing
brew "wemux"
# Internet file retriever
brew "wget"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community"
# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@3.4"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "adoptopenjdk11"
cask "adoptopenjdk14"
cask "airtame"
cask "alfred"
cask "bartender"
cask "charles"
cask "clion"
cask "datagrip"
cask "docker"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "gog-galaxy"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "insomnia"
cask "iterm2"
cask "kap"
cask "keepingyouawake"
cask "little-snitch"
cask "micro-snitch"
cask "mongodb-compass"
cask "ngrok"
cask "postico"
cask "private-internet-access"
cask "pycharm"
cask "rubymine"
cask "skype"
cask "slack"
cask "spectacle"
cask "spotify"
cask "tuple"
cask "use-engine"
cask "virtualbox"
cask "visual-studio-code"
cask "webstorm"
cask "zoomus"
